import React from 'react'
import { useState } from 'react'
import './HomePage.css'
import Header from '../../Components/Header/Header'
import QATemp from '../../Components/QATemp/QATemp'
import Footer from '../../Components/Footer/Footer'
import Payout from '../../Components/PayoutPopUp/Payout'

function HomePage() {

  const [clickPayout, setclickPayout] = useState(false) 

  const payoutButton = ()=> {
    setclickPayout(!clickPayout)
  }

  return (
    <>
      <Header/>
      <section className='main--content wrap'>
        <Payout clickPayout={clickPayout} setclickPayout={setclickPayout}/>
        <div className='header--content'>
          <div onClick={payoutButton} className='button'>برای سابسکرایب استریمر مورد نظرت اینجا کلیک کن!</div>
        </div>
        <div className='content'>
          <QATemp Question="سابسکریپشن به چه صورتی انجام می‌شود؟" Answer="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد"/>
          <QATemp Question="آیا می‌توان با یک اکانت چندین استریمر را سابسکرایب کرد؟" Answer="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد"/>
          <QATemp Question="هزینه‌ی سابسکریپشن به چه صورت حساب می‌شود؟" Answer="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد"/>
          <QATemp Question="چگونه می توانم با پشتیبانی در ارتباط باشم؟" Answer="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد"/>
        </div>
      </section>
      <Footer/>
    </>
  )
}

export default HomePage